## DataFrames/Series
Recap: Working with DataFrames and Series

In [2]:
import pandas as pd

In [3]:
## create Dataframe from scratch
df_scratch = pd.DataFrame({"Name": ["Max", "Sabine", "Klaus", "Pierre", "Suzanne"], "Age": [2,3,4,5,6]})
series_scratch = pd.Series({"Max": 2, "Sabine": 3, "Klaus": 4, "Pierre": 5, "Suzanne": 6})

In [4]:
print(df_scratch)
print(series_scratch)

      Name  Age
0      Max    2
1   Sabine    3
2    Klaus    4
3   Pierre    5
4  Suzanne    6
Max        2
Sabine     3
Klaus      4
Pierre     5
Suzanne    6
dtype: int64

In [5]:
print(type(df_scratch))
print(type(series_scratch))

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>

#### Transforming a Series into a DataFrame

In [6]:
df_from_series = pd.DataFrame(series_scratch)
df_from_series.head()

         0
Max      2
Sabine   3
Klaus    4
Pierre   5
Suzanne  6

#### Transforming a DataFrame into a Series

In [7]:
series_from_df = pd.Series(df_scratch.iloc[:, 1])
series_from_df

0    2
1    3
2    4
3    5
4    6
Name: Age, dtype: int64

#### Create a DataFrame from a csv file
Here, we load the classic Titanic dataset from Kaggle.

In [9]:
df = pd.read_csv("http://bit.ly/kaggletrain")
df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

Remember our selecting functions from the last section

In [8]:
df_short = df.loc[:2, "PassengerId": "Age"]
df_short

,PassengerId,Survived,Pclass,Name,Sex,Age
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0

## Data Joining

- sometimes we have several data sources which we liked to combine
- need to have a common feature in each data set to join/(merge) data from various sources  
- different methods on how our data can be joined together

<table><tr><td><img src='./pics/inner_join.PNG' width = 400></td><td><img src='pics/outer_join.PNG' width = 400></td></tr></table>
<table><tr><td><img src='./pics/left_join.PNG' width = 400+></td><td><img src='pics/right_join.PNG' width = 400></td></tr></table>

**Examples** 

**Inner Join** </br>
<img src="./pics/inner_join example.PNG" width = 400/>

**Outer Join** </br>
<img src="./pics/outer_join example.PNG" width = 400/>

**Left Join** </br>
<img src="./pics/left_join example.PNG" width = 400/>

**Right Join** </br>
<img src="./pics/right_join example.PNG" width = 400/>

### Let's do an example
- two data sets (GDP, Population) from the World Bank

**Preparation of the data & first look**

In [10]:
# read in the data sets
df_wb_gdp = pd.read_csv("./data/worldbank/WorldBank_GDP.csv")
df_wb_pop = pd.read_csv("./data/worldbank/WorldBank_POP.csv")

In [11]:
# have a quick look at the data sets
print("This is the GDP Data Set:")
print(df_wb_gdp.head(8))
print("This is the Population Data Set:")
print(df_wb_pop.head(8))

This is the GDP Data Set:
    Country Name Country Code     Indicator Name  Year           GDP
0          China          CHN  GDP (current US$)  2010  6.087160e+12
1        Germany          DEU  GDP (current US$)  2010  3.417090e+12
2          Japan          JPN  GDP (current US$)  2010  5.700100e+12
3  United States          USA  GDP (current US$)  2010  1.499210e+13
4          China          CHN  GDP (current US$)  2011  7.551500e+12
5        Germany          DEU  GDP (current US$)  2011  3.757700e+12
6          Japan          JPN  GDP (current US$)  2011  6.157460e+12
7  United States          USA  GDP (current US$)  2011  1.554260e+13
This is the Population Data Set:
           Country Name Country Code     Indicator Name  Year          Pop
0                 Aruba          ABW  Population, total  2010     101669.0
1           Afghanistan          AFG  Population, total  2010   29185507.0
2                Angola          AGO  Population, total  2010   23356246.0
3               Albania          ALB  Population, total  2010    2913021.0
4               Andorra          AND  Population, total  2010      84449.0
5            Arab World          ARB  Population, total  2010  354890042.0
6  United Arab Emirates          ARE  Population, total  2010    8549988.0
7             Argentina          ARG  Population, total  2010   40788453.0

**Let's merge the population the GDP dataset with merge()**

In [12]:
df_merged = df_wb_gdp.merge(df_wb_pop, how="left", on = ["Country Name", "Year"] )

df_merged.head()

,Country Name,Country Code_x,Indicator Name_x,Year,GDP,Country Code_y,Indicator Name_y,Pop
0,China,CHN,GDP (current US$),2010,6.087160e+12,CHN,"Population, total",1.337705e+09
1,Germany,DEU,GDP (current US$),2010,3.417090e+12,DEU,"Population, total",8.177693e+07
2,Japan,JPN,GDP (current US$),2010,5.700100e+12,JPN,"Population, total",1.280700e+08
3,United States,USA,GDP (current US$),2010,1.499210e+13,USA,"Population, total",3.093261e+08
4,China,CHN,GDP (current US$),2011,7.551500e+12,CHN,"Population, total",1.344130e+09

**Exercise**

- print out the first three rows of each DataFrame before merging
- Merge the following dataframes based on their name and save it into a new dataframe called df_job_hired
- print out the first 3 rows

In [13]:
df1_job = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2_hired = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})

**Solution**

In [14]:
print(df1_job.head(3))
print(df2_hired.head(3))

df_job_hired = df1_job.merge(df2_hired, on = "employee")
df_job_hired.head()

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

### Let's have a look at some additional parameters of merge

- e.g. suffixes, left_on, right_on

<img src="./pics/pandas dataframe merge.PNG" width = 600/>

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.merge.html

In [15]:
df_merged = df_wb_gdp.merge(df_wb_pop, how="left", on=["Country Name", "Year"], suffixes=("_df1", "_df2"))

df_merged.head()

,Country Name,Country Code_df1,Indicator Name_df1,Year,GDP,Country Code_df2,Indicator Name_df2,Pop
0,China,CHN,GDP (current US$),2010,6.087160e+12,CHN,"Population, total",1.337705e+09
1,Germany,DEU,GDP (current US$),2010,3.417090e+12,DEU,"Population, total",8.177693e+07
2,Japan,JPN,GDP (current US$),2010,5.700100e+12,JPN,"Population, total",1.280700e+08
3,United States,USA,GDP (current US$),2010,1.499210e+13,USA,"Population, total",3.093261e+08
4,China,CHN,GDP (current US$),2011,7.551500e+12,CHN,"Population, total",1.344130e+09

**Exercise**

In the DataFrame "df2_hired" somebody changed the name of the employee column. In addition, a sport column was added. See if both sport columns represent the same values and can be merged into one column.

Task: Merge the two DataFrames, save them in a new variable called "df_job_hired_2" and add suffixes ("_job", "_hired") so you can still distinguish the columns after merging. In the end print out the DataFrame.

<ins>Hint</ins>: use the parameters left_on, right_on of the .merge() -> check the documentation if needed

In [17]:
# making 2 practice dataframes
df1_job = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                        'group': ['Accounting', 'Engineering', 'Engineering', 'HR'],
                        "sport" : ["basketball", "football", "baseball", "pingpong"]
                       })

df2_hired = pd.DataFrame({'employee_names': ['Lisa', 'Bob', 'Jake', 'Sue'],
                         'hire_date': [2004, 2008, 2012, 2014],
                         "sport" : ["yes", "no", "no", "yes"]})

**Solution**

In [18]:
df_job_hired_2 = df1_job.merge(df2_hired, left_on = "employee", right_on="employee_names", suffixes = ("_job", "_hired"))
df_job_hired_2

  employee        group   sport_job employee_names  hire_date sport_hired
0      Bob   Accounting  basketball            Bob       2008          no
1     Jake  Engineering    football           Jake       2012          no
2     Lisa  Engineering    baseball           Lisa       2004         yes
3      Sue           HR    pingpong            Sue       2014         yes

**Relationship between two data sets**

<img src="./pics/One-to-One Relationships.PNG" width = 600/>


<img src="./pics/One-to-Many Relationship.PNG" width = 600/>

## Concatenating two dataframes
- stitching two dataframes together with .concat()

<img src="./pics/concat.PNG" width = 600/>

**Example:**

In [19]:
# read in our data
df = pd.read_csv("http://bit.ly/kaggletrain")
print("Shape of Original Dataframe: " + str(df.shape))

Shape of Original Dataframe: (891, 12)

In [28]:
df1 = df.iloc[:400, :]
df2= df.iloc[400:, ]

print("Shape of DF1: " + str(df1.shape))
print("Shape of DF2: " + str(df2.shape))

Shape of DF1: (400, 12)
Shape of DF2: (491, 12)

In [21]:
df_concat = pd.concat([df1, df2])
print("Shape of df_concat: " + str(df_concat.shape))

Shape of df_concat: (891, 12)

In [22]:
# checks if a Series/DataFrame when compared to each other are of the same shape and contain the same elements
df_concat.equals(df)

True

**Additional parameters in concat**

<img src="./pics/pandas_concat.PNG" width = 600/>

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.concat.html

**Let's redo our example and verify integrity**
- checks for duplicates in the two dataframes

In [29]:
df_concat = pd.concat([df1, df2], verify_integrity=True)

**Let's create a dataframe with duplicats** -> we get an error that indicates where the duplicate is at

In [31]:
df1 = df.iloc[:400, :]
df2 = df.iloc[399:, ]

df_concat = pd.concat([df1, df2], verify_integrity=True)

ValueError: Indexes have overlapping values: Int64Index([399], dtype='int64')

**Exercise**

In the following, two dataframes (BU1_df, and BU2_df) are given.
They share the same column names. Concatenate the dataframes and save them in a new dataframe called "business_df".

When you concatenated the dataframes, have a look at the index - it is not continuous. Add the parameter "ignore_index = True" to create a continuous index.

In [32]:
bu1_df = pd.DataFrame([{'Name': 'Kelly', 'Role': 'Director of HR', 'Location': 'State Street'},
                         {'Name': 'Sally', 'Role': 'Course liasion', 'Location': 'Washington Avenue'},
                         {'Name': 'James', 'Role': 'Grader', 'Location': 'Washington Avenue'}])
bu2_df = pd.DataFrame([{'Name': 'James', 'Role': 'Analyst', 'Location': '1024 Billiard Avenue'},
                           {'Name': 'Mike', 'Role': 'Regulations', 'Location': 'Fraternity House #22'},
                           {'Name': 'Sally', 'Role': 'Engineer', 'Location': '512 Wilson Crescent'}])

**Solution**

In [33]:
business_df = pd.concat([bu1_df, bu2_df], ignore_index = True)
business_df

    Name            Role              Location
0  Kelly  Director of HR          State Street
1  Sally  Course liasion     Washington Avenue
2  James          Grader     Washington Avenue
3  James         Analyst  1024 Billiard Avenue
4   Mike     Regulations  Fraternity House #22
5  Sally        Engineer   512 Wilson Crescent